# SetPath Method (String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageTypeOptions..::..SetPath Method (String)
ImageTypeOptions Class See Also
---
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative to the project's location. ImageType will respectively use an absolute or relative path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public void SetPath(
	string path
)
```

Visual Basic
---
```text
Public Sub SetPath ( _
	path As String _
)
```

Visual C++
---
```text
public:
void SetPath(
	String^ path
)
```

# ### Parameters
path
    Type: System..::..String The file path that specifies the image to be used.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ImageTypeOptions Class
SetPath Overload
Autodesk.Revit.DB Namespace